/*
                       Постановка задачи
  Написать шаблон функции, выполняющей указанные в вариа-тивной части задания действия.
   Написать программу тестирования шаблонных функций, созданных на основе этого шаблона,
   с аргументами указанных типов. Разработать шаблон класса, опи-сывающий указанный в вариативной части 
  задания абстрактный тип данных,
   и написать программу тестирования объектов двух шаблонных классов. Выбор тестируемого метода 
  должен осу-ществляться с помощью меню. Это задание может быть выполнено на трех уровнях сложности:
   низкий. Указанный АТД можно реализовать любым удобным способом;
   средний. Заданный АТД реализовать с помощью указанной структуры хранения;
   повышенный. Создать требуемый АТД с помощью двух структур хранения: векторной и списковой, 
  реализацию оформить в виде шаблонов классов с единым интерфейсом.
                        Варианты заданий
Вариант 18
  1. Перестановка элементов второй половины массива в обрат-ном порядке. 
  При нечетном количестве элементов центральный элемент массива не перемещать.
*/

#include "Dialog/ShowMainMenu.h"
int main(int argc, char const *argv[])
{
  ShowMainMenu();
  exit(EXIT_SUCCESS);
}
